#+BEGIN_EXPORT html
---
categories: nix
date: 2024-02-16
layout: default
title: "Nix Adventures Part 2: Machine Learning Servers"
parent: nix-adventures.org
---
#+END_EXPORT

#+title:     Nix Adventures Part 3: stable-diffusion-webui
#+author:    Logan Barnett
#+email:     logustus@gmail.com
#+date:      <2024-02-16 Fri>
#+language:  en
#+file_tags:
#+tags:
#+auto_id:   t
#+toc:       headlines 3

**** Struggle with the container
:PROPERTIES:
:CUSTOM_ID: adventure:-standing-up-a-=stable-diffusion-webui=-server-on-a-new-host--preparing-the-host--direct-builds--struggle-with-the-container
:END:

The [[https://nixos.wiki/wiki/Cheatsheet#Cross-compile_packages][Cross-compile packages]] section in this wiki article has something very
promising:

#+begin_quote
The following command will cross compile the tinc package for the aarch64 CPU
architecture from a different architecture (e.g. x86_64).
#+end_quote

#+begin_src shell :results none :exports code
$ nix-build '<nixpkgs>' \
  --arg crossSystem \
  '(import <nixpkgs> {}).lib.systems.examples.aarch64-multiplatform' \
  -A tinc
#+end_src

#+begin_quote
You can add your own specifications, or look at existing ones, in
nixpkgs/lib/systems/examples.nix.
#+end_quote

This seems to have taken my system over an hour to build, which is a little
nutty but I suppose makes sense if there's an entire Linux build ecosystem it
has to create from scratch.  I suppose that means that my local machine now has
all of that stuff cached though.

I thought I had read somewhere that =crossSystem= was deprecated, but I didn't
capture that anywhere.  Something to keep in mind as we continue down this
route.

If I adapt that example to my build, I get:

#+begin_src shell :results output :exports both :cache yes
nix-build '<nixpkgs>' --arg crossSystem '.#lithium'
#+end_src

#+RESULTS[e3d9e442c3d571d3bfb675a60d73a2a6aec7a7ef]:
: error: syntax error, unexpected '.'
:
:        at «string»:1:1:
:
:             1| .
:              | ^

I moved some stuff around - mostly flailing.  I have read before that the =.#=
thing is Nix Flake specific syntax or notation, so perhaps I have to explicitly
enable Flakes.  I thought I had that configured globally but my foray into
=nix-darwin= may have stomped on my user-specific configuration.


#+begin_src shell :results output :exports both :cache yes
nix \
  --extra-experimental-features nix-command \
  --extra-experimental-features flakes \
  build --arg crossSystem '.#lithium'
#+end_src

#+RESULTS[bc375ed355106fcf54f60e4a89f8b63b3eab4e52]:
: error: syntax error, unexpected '.'
:
:        at «string»:1:1:
:
:             1| .
:              | ^

How did this work before?  Searching for this error yields nothing related.

Eventually I tried:

#+begin_src shell :results output :exports both :cache yes
nix build '.#lithium'
#+end_src

#+RESULTS[541cad0f36dc04f36186ae1f17b8c037a6ae01cb]:
: warning: Git tree '/Users/logan/dev/blog' is dirty
: error: flake 'git+file:///Users/logan/dev/blog' does not provide attribute 'packages.aarch64-darwin.lithium', 'legacyPackages.aarch64-darwin.lithium' or 'lithium'

Alright, I think this means that the =--arg crossSystem= was somehow fouling up
further argument interpretation (or at least fouling up my understanding of how
it's supposed to behave).  This new result is promising, and one I know how to
address.  I have =lithium= declared under =aarch64-linux= which isn't going to
work from this perspective.  One thing to keep in mind is the attribute sets I
have in =outputs= is heavily predicated on the platform and architecture.  It
needs to be under =aarch64-darwin= while I am building from this machine.

An aside: When I started on this journey a while back with Flakes, I was a
little shocked that I had to specify each platform + architecture combination I
wanted to support.  I've come to realize though that Nix has a rich landscape
with which I can compose or override build settings.  So in that way, it's
pretty easy to specify which platforms are supported and have modules and such
to achieve reuse.  Unfortunately it doesn't work with the unsupported platforms
environment variable, but it does hold the promise that the build may not ever
work.  I don't know if there's a way to communicate "this can never work" verses
"it might work but I haven't explored that" or even "it should work but I don't
have resources to verify that".

#+begin_src shell :results output :exports both :cache yes
nix build '.#lithium'
#+end_src

#+RESULTS[541cad0f36dc04f36186ae1f17b8c037a6ae01cb]:
: warning: Git tree '/Users/logan/dev/proton-nix' is dirty
: error: builder for '/nix/store/rc9flq697nllbfczwxxnaczk5fimsb0j-X-Restart-Triggers-systemd-binfmt.drv' failed with exit code 126;
:        last 1 log lines:
:        > /nix/store/5l50g7kzj7v0rdhshld1vx46rf2k5lf9-bash-5.2p26/bin/bash: /nix/store/5l50g7kzj7v0rdhshld1vx46rf2k5lf9-bash-5.2p26/bin/bash: cannot execute binary file
:        For full logs, run 'nix log /nix/store/rc9flq697nllbfczwxxnaczk5fimsb0j-X-Restart-Triggers-systemd-binfmt.drv'.
: error: 1 dependencies of derivation '/nix/store/grwhri94w0zj0srv4p58fsnlq7ivfylw-unit-systemd-binfmt.service.drv' failed to build
: error: 1 dependencies of derivation '/nix/store/wxjwfw0836a7p26gk99c6sqhhl0nsnnv-system-units.drv' failed to build
: error: 1 dependencies of derivation '/nix/store/1768yij62f1x6dslv007z6iwgq0pspy5-etc.drv' failed to build
: error: 1 dependencies of derivation '/nix/store/ak7gyj97m24krqh5lxyn4zd0h1xpsk94-nixos-system-lithium-24.05.20240215.a4d4fe8.drv' failed to build
: error: 1 dependencies of derivation '/nix/store/h41y504h42v0xrfq6i3z0m0j5di8jysm-closure-info.drv' failed to build
: error: 1 dependencies of derivation '/nix/store/35ikws0vq9v4hvnagz2bdfrbmbpgqm41-efi-directory.drv' failed to build
: error: 1 dependencies of derivation '/nix/store/xw22x1f04k37v1d2h3sarn726w49jk5p-isolinux.cfg-in.drv' failed to build
: error: 1 dependencies of derivation '/nix/store/fa5rd5fwvc89rdij41klkhnmya7qsmgg-nixos.iso.drv' failed to build

I noticed with my =nix.nix= module, =buildPlatform= is still =aarch64-linux= and
so that needs correction to =aarch64-darwin=.

#+begin_src shell :results output :exports both :cache yes
nix build '.#lithium'
#+end_src

#+RESULTS[541cad0f36dc04f36186ae1f17b8c037a6ae01cb]:
: warning: Git tree '/Users/logan/dev/proton-nix' is dirty
: error: builder for '/nix/store/7cyzbdfc8d9ql30l1l15d72x11mdfmdf-etc-modprobe.d-nixos.conf.drv' failed with exit code 126;
:        last 1 log lines:
:        > /nix/store/5l50g7kzj7v0rdhshld1vx46rf2k5lf9-bash-5.2p26/bin/bash: /nix/store/5l50g7kzj7v0rdhshld1vx46rf2k5lf9-bash-5.2p26/bin/bash: cannot execute binary file
:        For full logs, run 'nix log /nix/store/7cyzbdfc8d9ql30l1l15d72x11mdfmdf-etc-modprobe.d-nixos.conf.drv'.
: error: builder for '/nix/store/kcfpzpaxv6zj431zfwz0rg1sy5j2din9-loopback.cfg.drv' failed with exit code 126;
:        last 1 log lines:
:        > /nix/store/5l50g7kzj7v0rdhshld1vx46rf2k5lf9-bash-5.2p26/bin/bash: /nix/store/5l50g7kzj7v0rdhshld1vx46rf2k5lf9-bash-5.2p26/bin/bash: cannot execute binary file
:        For full logs, run 'nix log /nix/store/kcfpzpaxv6zj431zfwz0rg1sy5j2din9-loopback.cfg.drv'.
: error: builder for '/nix/store/wq8pnjw6pxdpahk3dbhvwl40plf6bqq3-mounts.sh.drv' failed with exit code 126;
:        last 1 log lines:
:        > /nix/store/5l50g7kzj7v0rdhshld1vx46rf2k5lf9-bash-5.2p26/bin/bash: /nix/store/5l50g7kzj7v0rdhshld1vx46rf2k5lf9-bash-5.2p26/bin/bash: cannot execute binary file
:        For full logs, run 'nix log /nix/store/wq8pnjw6pxdpahk3dbhvwl40plf6bqq3-mounts.sh.drv'.
: error: builder for '/nix/store/zbm51nr0vm9gqh7cdn7zx74zp1m9k6ca-users-groups.json.drv' failed with exit code 126;
:        last 1 log lines:
:        > /nix/store/5l50g7kzj7v0rdhshld1vx46rf2k5lf9-bash-5.2p26/bin/bash: /nix/store/5l50g7kzj7v0rdhshld1vx46rf2k5lf9-bash-5.2p26/bin/bash: cannot execute binary file
:        For full logs, run 'nix log /nix/store/zbm51nr0vm9gqh7cdn7zx74zp1m9k6ca-users-groups.json.drv'.
: error: 1 dependencies of derivation '/nix/store/fa5rd5fwvc89rdij41klkhnmya7qsmgg-nixos.iso.drv' failed to build

Per [[https://github.com/nix-community/nixos-generators/issues/187][nixos-generators#187]] I tried:

#+begin_src shell :results output :cache yes :exports both
nix build --builders 'ssh-ng://nix@yasmin.dse.in.tum.de x86_64-linux' '.#lithium'
#+end_src

#+RESULTS[31c7e120ff3bcc3aa173e64c0af450092ed4d9d1]:
: warning: Git tree '/Users/logan/dev/proton-nix' is dirty
: error: builder for '/nix/store/7cyzbdfc8d9ql30l1l15d72x11mdfmdf-etc-modprobe.d-nixos.conf.drv' failed with exit code 126;
:        last 1 log lines:
:        > /nix/store/5l50g7kzj7v0rdhshld1vx46rf2k5lf9-bash-5.2p26/bin/bash: /nix/store/5l50g7kzj7v0rdhshld1vx46rf2k5lf9-bash-5.2p26/bin/bash: cannot execute binary file
:        For full logs, run 'nix log /nix/store/7cyzbdfc8d9ql30l1l15d72x11mdfmdf-etc-modprobe.d-nixos.conf.drv'.
: error: builder for '/nix/store/kcfpzpaxv6zj431zfwz0rg1sy5j2din9-loopback.cfg.drv' failed with exit code 126;
:        last 1 log lines:
:        > /nix/store/5l50g7kzj7v0rdhshld1vx46rf2k5lf9-bash-5.2p26/bin/bash: /nix/store/5l50g7kzj7v0rdhshld1vx46rf2k5lf9-bash-5.2p26/bin/bash: cannot execute binary file
:        For full logs, run 'nix log /nix/store/kcfpzpaxv6zj431zfwz0rg1sy5j2din9-loopback.cfg.drv'.
: error: builder for '/nix/store/wq8pnjw6pxdpahk3dbhvwl40plf6bqq3-mounts.sh.drv' failed with exit code 126;
:        last 1 log lines:
:        > /nix/store/5l50g7kzj7v0rdhshld1vx46rf2k5lf9-bash-5.2p26/bin/bash: /nix/store/5l50g7kzj7v0rdhshld1vx46rf2k5lf9-bash-5.2p26/bin/bash: cannot execute binary file
:        For full logs, run 'nix log /nix/store/wq8pnjw6pxdpahk3dbhvwl40plf6bqq3-mounts.sh.drv'.
: error: builder for '/nix/store/zbm51nr0vm9gqh7cdn7zx74zp1m9k6ca-users-groups.json.drv' failed with exit code 126;
:        last 1 log lines:
:        > /nix/store/5l50g7kzj7v0rdhshld1vx46rf2k5lf9-bash-5.2p26/bin/bash: /nix/store/5l50g7kzj7v0rdhshld1vx46rf2k5lf9-bash-5.2p26/bin/bash: cannot execute binary file
:        For full logs, run 'nix log /nix/store/zbm51nr0vm9gqh7cdn7zx74zp1m9k6ca-users-groups.json.drv'.
: error: 1 dependencies of derivation '/nix/store/fa5rd5fwvc89rdij41klkhnmya7qsmgg-nixos.iso.drv' failed to build

So no change.  I'm wracking my brain here to no effect.  Should I try to go back
to the Docker container to do a build?  I felt like I had so little control over
that environment that I would just be right back where I was.  My =nix=
invocation hasn't made any material changes.

This [[https://discourse.nixos.org/t/proper-way-to-build-a-remote-system-with-flakes/17661/12][post about making a remote build]] has a kind of promise to it:

#+begin_quote
just a small neat note,

that your flake.nix and configuration.nix, doesn’t have to sit /etc/nixos/ ,
they can be anywhere that is supported flake repo type (git/svn/mercurial), as
flakes are hermetically sealed (AFAIUSI). A system configuration can be built
from anywhere now allowing you to do funky things with the flake URI. However to
switch to the configuration, you will need to be stoopid user (superuser).

nix flake show github:nixinator/nothing/
nixos-rebuild dry-activate --flake github:nixinator/nothing/#z620

so you can build my ‘machine’. on yours. If that doesn’t blow new users minds,
especially the infrastructure as code people… i don’t know want can.

This post will probably prompt me to do some janitorial work on my configs… or
‘nix shaving’ as we like to term it.

flake makes truly sharable operating system configurations possible, which last
time i looked has never been possible.

However, hardware brings impurity, so my gfx card, network , containing that to
impurity is something i’ve got to think about long term, but for a fleet of
cattle, it’s a not really a problem.
#+end_quote

I don't think this works for me though because I need an _bootable image_ as the
output.  Though it is great and this is one of the things that I really like
about Nix.

I have come across some things about customizing a docker image.  I could also
just create a containerized-bootstrap configuration that gets loaded into the
container at build time and use that to control the environment.  This doesn't
feel like a good path to me.

Out of desperation, I ran =image-create.sh= again.  Please don't think poorly of
me.

While I'm waiting for that to happen, one of the roadblocks I've encountered is
the =binfmt= not being available on my machine.  I want to add that to the
container somehow.

I actually have to look up where the NixOS main Nix file is located.  This just
goes to show where my entire existence with Nix is: Not on the main operating
system but instead as a guest on macOS. The path is
=/etc/nixos/configuration.nix=.

And of course the VM won't start for =podman-machine=.  Great.

I've tried removing the VM.  I've added a =devShells= to my =flake.nix= to
ensure a specific version of =podman= and it looks like this:

#+begin_src nix :results none
...
  outputs = { self, nixpkgs, nixos-generators, ... }:
    let
      # This should be more localized.
      pkgs = nixpkgs.legacyPackages.aarch64-darwin;
    in
    {
    crossSystem = true;
    devShells.aarch64-darwin.default = pkgs.mkShell {
      packages = [
        pkgs.podman
      ];
    };
    ...
#+end_src

And I know the =flake.lock= will get populated and lock the version in place.
That way if I get it working, it should _stay_ working.  If I wanted to take it
a step further, I'd drop in some configuration that would allow me to keep it
separate from any potential system =podman= usage I would have.

This had the effect of bumping me from =podman= =4.8.2= to =4.9.3=, but still no
joy.  Now I must attempt the shameful thing I have seen others do: reboot.

-----

Well now I've restarted my +Windows+ macOS machine as a desperate maneuver to
remove any sort of gremlins that might be keeping the VM from starting up.  It
failed and my precious uptime was a pointless sacrifice.

I found [[https://github.com/containers/podman/issues/20776][podman#20776]] and I recall folks using =qemu= on their systems directly,
and not just in the container.  The layers are deep here.  I vaguely recall
having to install =qemu= separately before.  Putting it into my =devShells=, I
can see it's about a 1GB download.  Sheesh.  Another =podman machine init
--log-level DEBUG= and a 600MB download later, it takes about two solid minutes
for the VM to boot and do a lot of work, and then my local =podman= to connect.

I kind of hope there's some caching to take advantage of there.

There is!

I had to fix some things in my =image-create.sh= script.  My in-house container
was labeled =qemu-nix= when I meant to have it completely renamed to
=qemu-nix-personal= to avoid any public naming collisions, but I hadn't gotten
all of the references.

I quickly run into this problem:

#+begin_example
Error: can only create exec sessions on running containers: container state improper
#+end_example

The Internet is full of "derp make sure the container is started" but how did
this work before?  I did upgrade a minor point release.  SemVer strikes again,
apparently.  Remember that SemVer promises that minor releases should not cause
backward incompatible breaks.  If only intention alone were enough to ensure
compatibility and stability (SemVer thinks it is).

Oh I _do_ have =podman start= in my scripts.  I wrongly blamed SemVer, this
time.  But it didn't work?  Checking back, I see:

#+begin_example
Container ID: nix-run
#+end_example

With the relevant code being:

#+begin_src shell :results none :exports code
container_name="nix-run"
# ...snip...
image_label='qemu-nix-personal'
podman build -t qemu-nix-personal --file Dockerfile .
podman container ls -a | grep $container_name > /dev/null || \
        podman create -t --name $container_name -w /workdir \
            -v $PWD:/workdir qemu-nix-personal
container_id=$(podman start $container_name)
echo "Container ID: $container_id"
echo "Executing script:
$script
"
#+end_src

And =container_name= is =nix-run=.  How did the =container_name= become the
=container_id=?  I do see a UUID-like identifier in the spew right next to
=Container ID: ...= but I'm not sure what it's for.  A little extra logging:

#+begin_src shell :results none
image_label='qemu-nix-personal'
podman build -t qemu-nix-personal --file Dockerfile .
podman container ls -a | grep $container_name > /dev/null || \
        podman create -t --name $container_name -w /workdir \
            -v $PWD:/workdir qemu-nix-personal
echo "Starting $container_name..."
container_id=$(podman start $container_name)
echo "Container ID: $container_id"
echo "Executing script:
$script
"
#+end_src

This amounts to:

#+begin_example
Starting nix-run...
Container ID: nix-run
Executing script:
<snip>
Error: can only create exec sessions on running containers: container state improper
nix-run
#+end_example

So it's not getting _transposed_ somehow.  I flailed around a lot at this point.
Using =podman start= didn't make a lot of sense to me when I really tried to
understand what was going on.  I changed the =podman start ... podman exec= into
=podman run= and that works much better.

I can see what's in =/usr/bin/qemu*= now.

I can't see =/etc/nixos/configuration.nix= though.  This [[https://stackoverflow.com/a/43936744][Stack Overflow answer]]
says the image isn't a Nix image but an Alpine image.  Sigh.  Another user
shares some code to bootstrap a container like this with a Nix configuration:

#+begin_src shell :results none :exports code
git clone --branch release-17.03 https://github.com/nixos/nixpkgs $HOME/nixpkgs
mkdir -p $HOME/nix-config
nixos-generate-config --dir $HOME/nix-config

nixos-install -I nixos-config=$HOME/nix-config/configuration.nix -I nixpkgs=$HOME/nixpkgs
#+end_src

But I need =NixOS= proper, because I need to control its configuration so I can
use =binfmt=.

I have to say that this has gotten pretty frustrating.  It's possible the
problem is on my end but it's not obvious that it is.  I'm going in circles
regarding how to kick off a build.  It kind of makes sense that I can't
necessarily create an ISO image from =aarch64-darwin= if creating that ISO
necessitates running some of the things it creates (mostly dependencies).  It's
not just a single, static compilation.  This makes sense to me.  What I'm not
understanding is the path forward.  Perhaps this simply cannot be accomplished
on the wrong architecture, but that seems weird because I am seeing other people
emit =aarch64= images and builds from =x86_64=.  I just can't find out how to go
the other way.

=qemu= and =binfmt= are the watchwords here, and yet I don't feel like I have
the total control required to use them.  I'm not very familiar with the C build
ecosystem and I get the impression if I knew more, this would make more sense to
me.

I can't set =binfmt= without an actual NixOS system of some kind because that
requires both a Linux kernel setting and a NixOS-proper system itself running.
Even with containers, I have neither of those.  The =nixos/nix= image is for
running Nix and not NixOS, all on Alpine.  So using =binfmt= on the kernel level
is out.  How important is that?  [[https://en.wikipedia.org/wiki/Binfmt_misc][The Wikipedia article on binfmt_misc]] shows it
is simply part of the Linux kernel, and describes it as a sort of shebang for
binary executables.  I can see if it is enabled by inspecting
=/proc/sys/fs/binfmt_misc/status=, and there's also =/proc/sys/fs/binfmt_misc/*=
which holds various individual formats.  Being set to =1= is enabled and =-1= is
disabled.  I added this to my script in =image-create.sh=:

#+begin_src shell :results none :exports code
tail -n +1 /proc/sys/fs/binfmt_misc/*
#+end_src

I use =tail= because it prints the name of the file when multiple files are
involved.  That way I should get a nice file-name + value combination.  But I
get:

#+begin_example
tail: cannot open '/proc/sys/fs/binfmt_misc/*' for reading: No such file or directory
#+end_example

Of course I'm wondering why the =multiarch/qemu-user-static= image doesn't have
this.  I check the [[https://github.com/multiarch/qemu-user-static][README]] and see the description:

#+begin_example
multiarch/qemu-user-static is to enable an execution of different
multi-architecture containers by QEMU and binfmt_misc. Here are examples
with Docker 3.
#+end_example

The =binfmt_misc= is right there.  I was going to install it via my =Dockerfile=
and then it clicks:

#+begin_src dockerfile :results none :exports code
FROM multiarch/qemu-user-static:latest as qemu

FROM nixos/nix

COPY --from=qemu /usr/bin/qemu-* /usr/bin

COPY . /workdir

CMD ["sleep" "infinity"]
#+end_src

Oh right, I'm not running that image.  I'm running the =nix= image with some
stuff yanked from =qemu-user-static=.  Maybe I can also copy the =binfmt_misc=
files?  I know we're getting into kernel level stuff, and that's firmly
_outside_ of container territory.  Still, it's just files... right?  Let's give
it a shot.

#+begin_src dockerfile :results none
FROM multiarch/qemu-user-static:latest as qemu

FROM nixos/nix

COPY --from=qemu /usr/bin/qemu-* /usr/bin
COPY --from=qemu /proc/sys/fs/binfmt_misc /proc/sys/fs/binfmt_misc

COPY . /workdir

CMD ["sleep" "infinity"]
#+end_src

And then I get:

#+begin_example
Error: building at STEP "COPY --from=qemu /proc/sys/fs/binfmt_misc
/proc/sys/fs/binfmt_misc": checking on sources under
"/var/home/core/.local/share/containers/storage/overlay/ab39a17dbb861445876ff08d6d13ccf9cf2617ec6a81696481b535301310c2a1/merged":
copier: stat: "/proc/sys/fs/binfmt_misc": no such file or directory
#+end_example

Ugh.  Maybe I just need to read more.  A lot more.  That [[https://github.com/multiarch/qemu-user-static][qemu-user-static README]]
has a lot of stuff in there I didn't understand well as I just jumped in.
Apparently it has some kind of =from-to= notation I can use in the image name to
get what I want.  The entities in this are architectures.  So I should be able
to _from_ =aarch64= _to_ =x86_64=.  I just need to change the label from the
lazy =latest= to =qemu-user-static:aarch65-x86_64=.  I probably don't even need
to try copying the =binfmt_misc= files.

#+begin_example
Error: creating build container: initializing source
docker://multiarch/qemu-user-static:aarch65-x86_64: reading manifest
aarch65-x86_64 in docker.io/multiarch/qemu-user-static: manifest unknown
#+end_example

Alright.  Sure enough, I can't find an =aarch64= in the =from= portion anywhere
in their [[https://hub.docker.com/r/multiarch/qemu-user-static/tags?page=1&name=aarch][Dockerhub tags]].  Well, the documentation says I can use
=multiarch/qemu-user-static:$to_arch= so let's just try =x86_64=.

#+begin_example
[1/2] STEP 1/1: FROM multiarch/qemu-user-static:x86_64 AS qemu
Resolving "multiarch/qemu-user-static" using unqualified-search registries (/etc/containers/registries.conf.d/999-podman-machine.conf)
Trying to pull docker.io/multiarch/qemu-user-static:x86_64...
Getting image source signatures
Copying blob sha256:5822a1c91f704793666e9975a33f4041298b1221f5ac80aff67ea866300f64fa
Copying config sha256:ad2074fe564f645bba6172cd06d2c49771431ed4009d6726bc2145510d4e911b
Writing manifest to image destination
WARNING: image platform (linux/amd64) does not match the expected platform (linux/arm64)
--> ad2074fe564f
[2/2] STEP 1/4: FROM nixos/nix
[2/2] STEP 2/4: COPY --from=qemu /usr/bin/qemu-* /usr/bin
Error: building at STEP "COPY --from=qemu /usr/bin/qemu-* /usr/bin": checking on sources under "/var/home/core/.local/share/containers/storage/overlay/3999e542bb3199035ee740da6a25a788e0a6263a38ce1fb80bd2b3222c88363f/merged": Rel: can't make  relative to /var/home/core/.local/share/containers/storage/overlay/3999e542bb3199035ee740da6a25a788e0a6263a38ce1fb80bd2b3222c88363f/merged; copier: stat: ["/usr/bin/qemu-*"]: no such file or directory
#+end_example

So it pulled the image, but the base image is the wrong architecture as =amd64=
(and thus I expect nothing to work), and also the files I need are no longer
present.

From some reading in their issues, I find this [[https://github.com/multiarch/qemu-user-static/issues/111#issuecomment-647012621][comment]]:

#+begin_quote
Hi @Darshcg! This repository is for amd64/x86_64 hosts only (#77). For other
host archs, you can use dbhi/qus:

images are provided for each of seven host architectures officially supported by
Docker, Inc. or built by official images: amd64, i386, arm64v8, arm32v7,
arm32v6, s390x and ppc64le.
#+end_quote

I... why isn't that front-and-center on their README?  Why is this industry so
allergic to writing things down?  After looking some more, it is [[https://github.com/multiarch/qemu-user-static?tab=readme-ov-file#supported-host-architectures][in the README]]
but it's not presented early in the documentation.  I counted a quick 3 issues
that all have the same problem.  My personal policy is to treat questions like
those as opportunities to improve documentation.  Instead of fielding the
occasional "why didn't you read the _entire_ document?" questions, just improve
(by adding, rewording, or reorganizing) the documentation until the questions
cease.  Apparently the "these are images that go from any architecture to any
architecture" and then the fine print says "only if the from-architecture is
x86_64 or amd64", one can understand why there is misunderstanding.  It's like
how Microsoft claimed .NET was cross-platform back during its inception.  It
runs on all versions of Windows!  See?  Cross-platform.

The [[https://dbhi.github.io/qus/images.html][qus documentation]] on what images to use is not inspiring:

#+begin_quote
Manifests are provided for the following hosts: amd64, arm64v8, arm32v7,
arm32v6, i386, s390x or ppc64le. That is, any of the target architectures
provided by QEMU can be used on any of those hosts.
#+end_quote

No =x86_64=.  This seems to make the claim that they support everything that
=qemu= does.  This would imply that =qemu= doesn't support =x86_64= as a
destination, but other things I have come across suggests that's impossible
(folks on =aarch64= claim to have =x86_64= compatibility).  [[https://github.com/dbhi/qus/issues/22][qus#22]] suggests this
will work just fine though.  That said, I can't find the images on Dockerhub.

I did some more digging around and came up with this as my =Dockerfile=:

#+begin_src dockerfile :results none
FROM nixos/nix

COPY . /workdir

CMD ["sleep" "infinity"]
#+end_src

Not much, yeah?  That's because I need to bootstrap the Podman VM with:

#+begin_src shell :results none :exports code
podman run --rm --privileged aptman/qus --static -- --persistent x86_64
#+end_src

Which I put into =with-podman.sh=.

Now I get:

#+begin_example
error: builder for '/nix/store/23n6mw7qvl7w6c9pmgmwzi5gpwg0qjkl-stdenv-linux.drv' failed with exit code 1;
       last 1 log lines:
       > error: executing '/nix/store/xiicriwhj094ax7w50jzkmv32gzcdqkd-bash-5.2p26/bin/bash': Exec format error
       For full logs, run 'nix log /nix/store/23n6mw7qvl7w6c9pmgmwzi5gpwg0qjkl-stdenv-linux.drv'.
#+end_example

I think maybe this is some progress?  I haven't gotten this specific error yet.
Before it was =cannot execute binary file=.  So that makes me think at least
some of the machinery I want is in place.

**** darwin.linux-builder to the rescue
:PROPERTIES:
:CUSTOM_ID: adventure:-standing-up-a-=stable-diffusion-webui=-server-on-a-new-host--preparing-the-host--direct-builds--darwin.linux-builder-to-the-rescue
:END:

Then I found [[https://github.com/NixOS/nixpkgs/pull/238596][nixpkgs#238596]] and wait a second!  There's a =nixos/qemu-vm=...
image?  I dug around and found [[https://github.com/NixOS/nixpkgs/blob/master/nixos/modules/virtualisation/qemu-vm.nix][qemu-vm.nix]] and it has this as documentation:

#+begin_src shell :results none :exports code
# This module creates a virtual machine from the NixOS configuration.
# Building the `config.system.build.vm' attribute gives you a command
# that starts a KVM/QEMU VM running the NixOS configuration defined in
# `config'. By default, the Nix store is shared read-only with the
# host, which makes (re)building VMs very efficient.
#+end_src

This is manna from the =nixpkgs=!  Using this, I should be able to put the VM in
the _exact_ state I want it to be in before I try anything (like running this
builder).  I shouldn't need to use a container at all, in fact...  I basically
can say "this is my build VM, and here's its configuration", which tucks nicely
into the =flake.lock=.  This is exciting!  I don't know if it will work as a
path forward, but it should help.  I should be able to pull in =qemu=
derivations with ease.  I can set =binfmt=!  What an oasis to come upon.  My
despair was palpable.

-----

I dove into the material for running this builder VM locally.  There's actually
[[https://nixos.org/manual/nixpkgs/unstable/#sec-darwin-builder][official documentation on the darwin.linux-builder]] and via this
[[https://nixcademy.com/2024/02/12/macos-linux-builder/][macOS Linux Builder]] post, I found out there's some settings I can use on
=nix-darwin= that do a lot of the setup necessary to get it going, but it's more
or less a one-liner.

I don't have the exact order of things here, and unfortunately the VM is
somewhat stateful.  I'll try to document what I can.  This is what builds the
VM:

#+begin_src shell :results none :exports code
nix run nixpkgs#darwin.linux-builder
#+end_src

The VM being built is a somewhat manual step, but perhaps some other thing can
realize it.  Keep in mind if anything changes or you attempt to build a
different kind of VM, this can foul up the derivation.  Advice I have seen in
multiple places (that I don't have on hand) says to "remove the VM" but provides
no instructions.  I was able to do so with a =nix store gc=.  It's using a
wrecking ball to drive a nail, but it does the job.  Perhaps better advice will
become available.

A builder in Nix is a special host which is configured to accept build commands
from a different Nix host.  Essentially it gets used in NixOps (Nix Operations)
type setups, where different kinds of builds for different architectures must be
emitted, or multi-platform tests must be run.  The VM needs to be configured as
a builder.  This means the VM needs to run SSH, expose it on a port, and have
keys registered with it.  The =nix-darwin= module does all of this with the
following settings:

#+begin_src nix :results none
nix = {
  # There may be additional configuration in this attribute set.  This is the
  # minimum for what we need here.
  linux-builder.enable = true;
  settings = {

    experimental-features = [ "nix-command" "flakes" ];
    # Action: Update to use your user as needed, in case you aren't also a Logan.
    # Trust my user so we can open SSH on port 22 for using the Nix builder.
    # It cannot be overridden as of 2024-02-18.  This is demanded in
    # https://nixos.org/manual/nixpkgs/unstable/#sec-darwin-builder but
    # explained here:
    # https://github.com/Gabriella439/macos-builder?tab=readme-ov-file
    extra-trusted-users = [ "logan" ];
    # Trusting @admin is demanded by the darwin.linux-builder package.
    trusted-users = [ "@admin" ];
  };
};
#+end_src

Performing the following will apply those settings:

#+begin_src shell :results none :exports code
nix run nix-darwin -- switch --flake ~/dev/dotfiles/nix
#+end_src

In addition, the =nix-darwin= module configures this via a =launchd= daemon.
You can inspect the daemon here:

#+begin_src shell :results output :cache yes :exports both :dir "/sudo:root@localhost:."
sudo launchctl list org.nixos.linux-builder
#+end_src

#+RESULTS[05af8f2e26dbaf5f17504219461aad6840ae5dad]:
: {
: 	"LimitLoadToSessionType" = "System";
: 	"Label" = "org.nixos.linux-builder";
: 	"OnDemand" = false;
: 	"LastExitStatus" = 0;
: 	"PID" = 19592;
: 	"Program" = "/bin/sh";
: 	"ProgramArguments" = (
: 		"/bin/sh";
: 		"-c";
: 		"/bin/wait4path /nix/store && exec /nix/store/sf0vk5w0clqmwp07p5m0w3lxl1sc150s-linux-builder-start";
: 	);
: };

The PID may imply that it is already running?

I ran into this error at some point.  I believe it is because somehow the VM
changed as I described above.  I had gone through several different sets of
instructions, so the changed-VM-issue is very likely.

#+begin_example
Formatting '/tmp/nix-vm.S35Kv5pSsw/store.img', fmt=qcow2 cluster_size=65536 extended_l2=off compression_type=zlib size=1561329664 backing_file=/nix/store/lyd8dji7qbsk3kp0fy7aiiv07igc1qz9-nix-store-image/nixos.qcow2 backing_fmt=qcow2 lazy_refcounts=off refcount_bits=16
[    0.034887] armv8-pmu pmu: hw perfevents: failed to probe PMU!

<<< NixOS Stage 1 >>>

loading module virtio_balloon...
loading module virtio_console...
loading module virtio_rng...
loading module dm_mod...
running udev...
Starting systemd-udevd version 255.2
kbd_mode: KDSKBMODE: Inappropriate ioctl for device
Gstarting device mapper and LVM...
waiting for device /dev/disk/by-label/nixos to appear.......................
Timed out waiting for device /dev/disk/by-label/nixos, trying to mount anyway.
mounting /dev/disk/by-label/nixos on /...
[   21.655501] /dev/disk/by-label/nixos: Can't open blockdev
mount: mounting /dev/disk/by-label/nixos on /mnt-root/ failed: No such file or directory

An error occurred in stage 1 of the boot process, which must mount the
root filesystem on `/mnt-root' and then start stage 2.  Press one
of the following keys:

  r) to reboot immediately
  *) to ignore the error and continue
rRebooting...
[   28.407770] reboot: Restarting system
[    0.033519] armv8-pmu pmu: hw perfevents: failed to probe PMU!

<<< NixOS Stage 1 >>>

loading module virtio_balloon...
loading module virtio_console...
loading module virtio_rng...
loading module dm_mod...
running udev...
Starting systemd-udevd version 255.2
kbd_mode: KDSKBMODE: Inappropriate ioctl for device
Gstarting device mapper and LVM...
waiting for device /dev/disk/by-label/nixos to appear.......^C................
Timed out waiting for device /dev/disk/by-label/nixos, trying to mount anyway.
mounting /dev/disk/by-label/nixos on /...
[   21.900472] /dev/disk/by-label/nixos: Can't open blockdev
mount: mounting /dev/disk/by-label/nixos on /mnt-root/ failed: No such file or directory

An error occurred in stage 1 of the boot process, which must mount the
root filesystem on `/mnt-root' and then start stage 2.  Press one
of the following keys:

  r) to reboot immediately
  *) to ignore the error and continue
^C*Continuing...
mount: can't find /mnt-root/ in /proc/mounts
mounting certs on /etc/ssl/certs...
checking /dev/disk/by-label/nix-store...
fsck (busybox 1.36.1)
[fsck.ext4 (1) -- /mnt-root/nix/.ro-store] fsck.ext4 -a /dev/disk/by-label/nix-store
nix-store: clean, 46478/95424 files, 284784/381184 blocks
mounting /dev/disk/by-label/nix-store on /nix/.ro-store...
mounting shared on /tmp/shared...
mounting xchg on /tmp/xchg...
mounting keys on /var/keys...
mounting overlay filesystem on /nix/store...
BusyBox v1.36.1 () multi-call binary.

Usage: switch_root [-c CONSOLE_DEV] NEW_ROOT NEW_INIT [ARGS]

Free initramfs and switch to another root fs:
chroot to NEW_ROOT, delete all in /, move NEW_ROOT to /,
execute NEW_INIT. PID must be 1. NEW_ROOT must be a mountpoint.

	-c DEV	Reopen stdio to DEV after switch
[   50.120061] Kernel panic - not syncing: Attempted to kill init! exitcode=0x00000100
[   50.120291] CPU: 0 PID: 1 Comm: switch_root Not tainted 6.1.78 #1-NixOS
[   50.120547] Hardware name: linux,dummy-virt (DT)
[   50.120738] Call trace:
[   50.120845]  dump_backtrace+0xe0/0x134
[   50.121005]  show_stack+0x20/0x2c
[   50.121145]  dump_stack_lvl+0x64/0x80
[   50.121309]  dump_stack+0x18/0x34
[   50.121444]  panic+0x17c/0x350
[   50.121579]  make_task_dead+0x0/0x190
[   50.121733]  do_group_exit+0x3c/0xa0
[   50.121887]  __wake_up_parent+0x0/0x40
[   50.122040]  invoke_syscall+0x50/0x120
[   50.122194]  el0_svc_common.constprop.0+0x4c/0xf4
[   50.122384]  do_el0_svc+0x34/0xcc
[   50.122521]  el0_svc+0x34/0xd4
[   50.122651]  el0t_64_sync_handler+0x114/0x120
[   50.122831]  el0t_64_sync+0x18c/0x190
[   50.122983] Kernel Offset: 0x4ee1cc200000 from 0xffff800008000000
[   50.123236] PHYS_OFFSET: 0xffff9a3c00000000
[   50.123416] CPU features: 0x00000,00010091,66927723
[   50.123673] Memory Limit: none
[   50.123804] ---[ end Kernel panic - not syncing: Attempted to kill init! exitcode=0x00000100 ]---
[1]    15699 terminated  nix run nixpkgs#darwin.linux-builder

Terminate the process by using =ps= in another tab and issuing a normal =kill=
to the qemu process.  =ps= without args or =grep= is sufficient.
#+end_example

When encountering this error, there is something wrong with the VM and it is
stateful.  Advice is to "remove" the image, but no specific instructions are
given.  Run =nix store gc= to clean it up.  This could be a documentation
enhancement.  This would be good to contribute back to documentation.

Now that I have what I think is an on-demand linux-builder service for macOS, I
should be able to just build a VM image and Nix will take care of the rest.  I
have seen advice that I might need to tune the VM for different resources, but I
figure I can do that lazily.  All I really care about this point are halts.  The
image building is a one-off for me.

I don't know how to make sure the builder is present in a given build.  However
I do know I'll need some additional tuning to make this work.  I've added this
to my =darwin.nix= and applied it:

#+begin_src nix  :results none
  ...
  nix = {
    linux-builder = {
      enable = true;
      config = {
        boot.binfmt.emulatedSystems = [ "x86_64-linux" ];
      };
    };
  };
  ...
#+end_src

I still see the issue:

#+begin_example
nix build '.#lithium'
warning: Git tree '/Users/logan/dev/proton-nix' is dirty
error: builder for '/nix/store/2kx4di5f5qjqhhvgy3k2zxcbrwxylgkl-builder.pl.drv' failed with exit code 126;
       last 1 log lines:
       > /nix/store/5l50g7kzj7v0rdhshld1vx46rf2k5lf9-bash-5.2p26/bin/bash: /nix/store/5l50g7kzj7v0rdhshld1vx46rf2k5lf9-bash-5.2p26/bin/bash: cannot execute binary file
...
#+end_example

From my last =nix-darwin-switch= call, I don't think my changes got applied
because the image wasn't touched as far as I can tell. I expected that to take
a while longer but it was very quick.  Reading the blog earlier, I can see that
I need to do a =nixos-rebuild= on that VM.  But it requires knowing its name
first.  To get it, I ran:

#+begin_src shell :results output :exports both :cache yes
cat /etc/nix/machines | sed -E 's/- [a-zA-Z0-9=]+$/- secret-ssh-key-maybe/'
#+end_src

#+RESULTS[2cf59cef3beb69a938d04fe8e0c2a01318297f3e]:
: ssh://builder@linux-builder aarch64-linux /etc/nix/builder_ed25519 1 1 kvm,benchmark,big-parallel - secret-ssh-key-maybe

With this going through =sed= so I needn't worry about a key getting leaked if
it happens to be a secret one.  I can see its name is =linux-builder=.  In
hindsight, this is what I named it in the =darwin.nix=.  Great!  An adapted
version of the configuration is:

#+begin_src shell :results none :exports code
nixos-rebuild switch \
    --fast \
    --target-host linux-builder \
    --use-remote-sudo \
    --use-substitutes
#+end_src

And this doesn't work because I'm on macOS where =nixos-rebuild= is not on my
=PATH= because this isn't NixOS.  Perhaps I can just SSH to the host and run the
command there, sans target arguments?

#+begin_example
$ ssh builder@linux-builder
The authenticity of host 'linux-builder ([127.0.0.1]:31022)' can't be established.
ED25519 key fingerprint is SHA256:73nCAX7tESRWJ4ZN8RkOlqB+0bgxKVmbNRUcFPbXMkE.
This key is not known by any other names.
Are you sure you want to continue connecting (yes/no/[fingerprint])? yes
Warning: Permanently added 'linux-builder' (ED25519) to the list of known hosts.
(builder@linux-builder) Password:
#+end_example

Close.  Trying with my username has the same result.  Perhaps I can bootstrap it
like I did my Raspberry Pi earlier?

I add this to the =config=, which becomes:

#+begin_src nix :results none
  nix = {
    linux-builder = {
      enable = true;
      config = {
        boot.binfmt.emulatedSystems = [ "x86_64-linux" ];
        users.users = {
          logan = {
            # TODO: You can set an initial password for your user.
            # If you do, you can skip setting a root password by passing
            # '--no-root-passwd' to nixos-install.
            # Be sure to change it (using passwd) after rebooting!
            initialPassword = "lolno";
            isNormalUser = true;
            openssh.authorizedKeys.keys = [
              "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQOx2dxH8oP1406bie6eO3HB6fin4NY01laNiWRqcNsrRl6/M6e80wiTnG9u0Walb3JXegyqrHKIlFgvcrn2Tg/y944akJ/XqrcLPn3vwTcCV6XGI/1hPdcN0V156pbbnTS/T9y9btO+QJvELOjT4dET6HixBeBpGhLM95cirOrJjT2C6VVBYTGdAu3eKwCeDsjQtfKOHp9Huv0c1i57Fb13iTU1u0+L2o+LMYpS8YNbcBOgzx9FyyjvA/KuEVcyt2raVpbJv6nOP9ynz7a1Ja3Y2tgQwC6XCMpgKYHDYxaJhJbWjv9cxwq4zSzBr8yrlDKooqvpp9fTdOBAWF4R2MI2wb01yaaTlqPDcATBl5+Xu+SvxYf9wBt6wFIbv0baf1WtDDE7u9d2K/MJhShK9p45AQPTbmoYw7fzeMQOLdZNdZdXIOHWd17IJi2T+WnnO9hL1x+M5uZUlFlk0jGu0NP/YmHuWjGxxL7AIO1hH2q7ZHq7tzM+8sV6tjfGePwALFXSBBSGn2czgtfKzEVRFHBQajPco0g9zFWvi5ZfmU4QAkWOrQQFLEYK4IE0e1gR9Dsnqdm5tiYkCdVlapbG9jWdIBAgOCMj2bBXn+YObCrbVHW4wNo5OR6nec+b6miCuG23ue/o5j2L64kE16n1+hGx/Bbm0Adif4vw8zXVhAmxvQ== logan@scandium"
            ];
            extraGroups = [
              # Allow this user to sudo.
              "wheel"
            ];
          };
        };
      };
    };
#+end_src

And look at that:

#+begin_example
$ nix-darwin-switch
warning: Git tree '/Users/logan/dev/dotfiles' is dirty
building the system configuration...
warning: Git tree '/Users/logan/dev/dotfiles' is dirty
Password:
user defaults...
setting up user launchd services...
Show the ~/Library folder...
Set dock magnification...
Set dock magnification size...
Define dock icon function...
Choose and order dock icons
setting up /Applications/Nix Apps...
setting up pam...
applying patches...
setting up /etc...
system defaults...
setting up launchd services...
reloading service org.nixos.linux-builder
reloading nix-daemon...
waiting for nix-daemon
configuring networking...
configuring keyboard...
Set disk image verification...
Avoid creating .DS_Store files on network volumes...
Set the warning before emptying the Trash...
Require password immediately after sleep or screen saver begins...
Allow apps from anywhere...

$ ssh linux-builder

[logan@nixos:~]$
#+end_example

I am tickled!  Let's get our bearings.  I have a NixOS VM running on macOS which
is totally controlled via Nix and has a proper =configuration.nix=.  This allows
me to do things I couldn't do before like set =binfmt.emulatedSystems=.  From
there I should be able to build NixOS images for =x86_64-linux=.  My next steps
are roughly:

1. Verify I can compile and run =x86_64-linux= binaries.  This will allow me to
   build an =x86_64-linux= image, since these images require running some of the
   things being built.
2. Indicate to =nixosGenerate= that the build is actually going to be run
   against =linux-builder=.
3. Generate the image.
4. =dd= the image to the USB drive adapter (which has the lithium boot disk in
   it).
5. Slap the disk in the lithium machine.  Power it on, connect it on the
   network (via a CAT 5 cable).
6. SSH to the host to test login.
7. Author a Nix configuration for =stable-diffusion-webui= that allows
   configuration.
8. Apply the configuration to =lithium=.
9. Crank out ML generated images to my heart's content.

Easy!

Trying to get something going from my SSH session is proving difficult.  =nix=
is not on my =PATH=, and =/nix/var/nix/profiles/per-user/= is empty.  This
really is just a bare bones builder.  Well, let's treat it that way.  I should
be able to declare an =x86_64-linux= package exists on the host, and then maybe
run it.

I wound up making this:

#+begin_src nix :results none
{
  nixpkgs,
  lib,
  ...
}: let
  cross-architecture-test-pkgs = import nixpkgs {
    system = "x86_64-linux";
  };
  linux-builder-pkgs = import nixpkgs {
    system = "aarch64-linux";
  };
in {
  boot.binfmt.emulatedSystems = [ "i686-linux" "x86_64-linux" ];
  environment.systemPackages = [
    linux-builder-pkgs.file
    cross-architecture-test-pkgs.hello
  ];
  nixpkgs.buildPlatform = { system = "aarch64-linux"; };
  users.users = {
    logan = {
      # TODO: You can set an initial password for your user.
      # If you do, you can skip setting a root password by passing
      # '--no-root-passwd' to nixos-install.
      # Be sure to change it (using passwd) after rebooting!
      initialPassword = "lolno";
      isNormalUser = true;
      openssh.authorizedKeys.keys = [
        "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQOx2dxH8oP1406bie6eO3HB6fin4NY01laNiWRqcNsrRl6/M6e80wiTnG9u0Walb3JXegyqrHKIlFgvcrn2Tg/y944akJ/XqrcLPn3vwTcCV6XGI/1hPdcN0V156pbbnTS/T9y9btO+QJvELOjT4dET6HixBeBpGhLM95cirOrJjT2C6VVBYTGdAu3eKwCeDsjQtfKOHp9Huv0c1i57Fb13iTU1u0+L2o+LMYpS8YNbcBOgzx9FyyjvA/KuEVcyt2raVpbJv6nOP9ynz7a1Ja3Y2tgQwC6XCMpgKYHDYxaJhJbWjv9cxwq4zSzBr8yrlDKooqvpp9fTdOBAWF4R2MI2wb01yaaTlqPDcATBl5+Xu+SvxYf9wBt6wFIbv0baf1WtDDE7u9d2K/MJhShK9p45AQPTbmoYw7fzeMQOLdZNdZdXIOHWd17IJi2T+WnnO9hL1x+M5uZUlFlk0jGu0NP/YmHuWjGxxL7AIO1hH2q7ZHq7tzM+8sV6tjfGePwALFXSBBSGn2czgtfKzEVRFHBQajPco0g9zFWvi5ZfmU4QAkWOrQQFLEYK4IE0e1gR9Dsnqdm5tiYkCdVlapbG9jWdIBAgOCMj2bBXn+YObCrbVHW4wNo5OR6nec+b6miCuG23ue/o5j2L64kE16n1+hGx/Bbm0Adif4vw8zXVhAmxvQ== logan@scandium"
      ];
      extraGroups = [
        # Allow this user to sudo.
        "wheel"
      ];
    };
  };
  nix.settings = {
    extra-platforms = [ "aarch64-linux" "i686-linux" "x86_64-linux" ];
  };
}
#+end_src

It took me a bit to get here.  The current point of interest is in the
declaration of =linux-builder-pkgs= and =cross-architecture-test-pkgs=.  These
are both using =nixpkgs= but from a different =system= setting.  The first is
for the =linux-builder= itself, so it uses =aarch64-linux= (my physical
architecture, but Linux instead of macOS / =darwin=).  The other is
=x86_64-linux=.

Once that got built, I was able to do this as a proof that I could produce and
run different binaries:

#+begin_example
$ ssh linux-builder
Last login: Wed Feb 21 06:55:28 2024 from 10.0.2.2

[logan@nixos:~]$ hello
Hello, world!

[logan@nixos:~]$ file $(readlink -f $(which hello))
/nix/store/63l345l7dgcfz789w1y93j1540czafqh-hello-2.12.1/bin/hello: ELF 64-bit LSB executable, x86-64, version 1 (SYSV), dynamically linked, interpreter /nix/store/cyrrf49i2hm1w7vn2j945ic3rrzgxbqs-glibc-2.38-44/lib/ld-linux-x86-64.so.2, for GNU/Linux 3.10.0, not stripped
#+end_example

In the example above I run =hello= on the VM.  Then I identify the =hello=
binary as being an =x86_64-linux= binary in spite of the fact that I'm running
=aarch64-darwin= natively, and =aarch64-linux= on the VM.

One thing to keep in mind that I sunk a lot of time into: The =nix store ping=
[fn:nix-store-ping-info: There is also =nix store info=, but I don't know which
is the preferred one - just that one is deprecated.  I cannot run =nix store
info= on my host and attempts to enable it via =experimental-features= has
failed for me.] is not very helpful in determining what's going on.  For the
longest time, I had this:

#+begin_src shell :results output :cache yes
nix store ping --store 'ssh-ng://linux-builder'
#+end_src

#+RESULTS[1e63ec6d4dd5d87685780e1fdf9d01bfcd881418]:
: Store URL: ssh-ng://linux-builder
: [K[KVersion: 2.18.1
: Trusted: 0

I found this was due to me declaring =builders= in my =darwin.nix=.  The
=builders= definition was out of sync with the actual configuration, and the
=nix-darwin= =linux-builder= module is smart enough to populate everything from
top to bottom.  You can help see what's going on with =/etc/nix/machines=.  The
[[https://nixos.org/manual/nix/stable/advanced-topics/distributed-builds][remote builder documentation]] describes the format very well, and it is plain
text.  What helped me figure this out was eventually running a =nix build= with
=--builders= set to the entire line.

Another critical part was also working with =linux-builder= configuration
options that weren't fully propagated to the =buildMachines= settings.  I wound
up having to add my own option (=protocol=) and stitching that together with
[[https://github.com/LnL7/nix-darwin/pull/873][nix-darwin#873]] and [[https://github.com/LnL7/nix-darwin/pull/816][nix-darwin#816]], one of which was only two days old at my
first approach ([2024-02-20 Tue]).  Here is the [[https://github.com/LoganBarnett/nix-darwin/tree/linux-builder-big-config][branch for all of them together]].

#+begin_src shell :results none
nix build \
  '.#lithium' \
  --builders 'ssh-ng://builder@linux-builder i686-linux,x86_64-linux,aarch64-linux /etc/nix/builder_ed25519 1 1 kvm,benchmark,big-parallel - lolno'
#+end_src

And I was able to observe transient status updates of sending build information
to the remote builder (=linux-builder=).  Even with that, =nix store ping= still
shows =Trusted: 0= so I guess this can't be relied upon.

#+begin_src shell :results output :cache yes
nix store ping --store 'ssh-ng://linux-builder'
#+end_src

#+RESULTS[1e63ec6d4dd5d87685780e1fdf9d01bfcd881418]:
: Store URL: ssh-ng://linux-builder
: [K[KVersion: 2.18.1
: Trusted: 0

**** Diving into the Nix store C++ code
:PROPERTIES:
:CUSTOM_ID: adventure:-standing-up-a-=stable-diffusion-webui=-server-on-a-new-host--preparing-the-host--direct-builds--diving-into-the-nix-store-c++-code
:END:

I went on a bit of a tangent trying to figure out what the deal was with
=Trusted: 0= and I dove into the C++ code.  For posterity I've left it here, but
the end result is that I didn't really learn anything solid.  It was difficult
to follow as my C++ has atrophied and I never really picked up "industry" style
C++, let alone kept up with the last 20 years of changes in practice since then.
[[https://github.com/NixOS/nix/pull/3927][nix#3927]] (a pull request that is ~4 years old as of [2024-02-21 Wed]) would have
probably kept me from having to do as much of a deep dive on all of this.  Maybe
I can try out carrying through the requested changes sometime.

-----

So basically =ssh://= will never work, per the code in
=src/libstore/legacy-ssh-store.cc=:

#+begin_src c :results none :exports code
/**
 * The legacy ssh protocol doesn't support checking for trusted-user.
 * Try using ssh-ng:// instead if you want to know.
 */
std::optional<TrustedFlag> isTrustedClient()
{
    return std::nullopt;
}
#+end_src

More spelunking - I found =src/libstore/remote-store-connection.hh= declares
=RemoteStore::Connection= which has a =remoteTrustsUs= field on it.  This is the
field that describes what eventually comes back on the =nix store ping=
invocation.  The _only_ place that gets set to an meaningful value is in
=src/libstore/remote-store.cc= in =initConnection= as this:

#+begin_src c :results none :exports code
if (GET_PROTOCOL_MINOR(conn.daemonVersion) >= 35) {
    conn.remoteTrustsUs = WorkerProto::Serialise<std::optional<TrustedFlag>>::read(*this, conn);
} else {
    // We don't know the answer; protocol to old.
    conn.remoteTrustsUs = std::nullopt;
}
#+end_src

This is basically an undocumented requirement for establishing trust.  Back from
my earlier =ping=:

#+begin_src shell :results output :cache yes
nix store ping --store 'ssh-ng://linux-builder'
#+end_src

#+RESULTS[1e63ec6d4dd5d87685780e1fdf9d01bfcd881418]:
: Store URL: ssh-ng://linux-builder
: [K[KVersion: 2.18.1
: Trusted: 0

I have only =18= as my minor version and it wants 35 or more.  This seems off.
The whole "minor" thing seems off.  I would expect a more sophisticated version
check but I don't see it here.  Let's unpack this more.

=GET_PROTOCOL_MAJOR= and =GET_PROTOCOL_MINOR= are defined as:

#+begin_src c :results none :exports code
#define GET_PROTOCOL_MAJOR(x) ((x) & 0xff00)
#define GET_PROTOCOL_MINOR(x) ((x) & 0x00ff)
#+end_src

This just looks at the number and yanks off the first 16 bits or the last 16
bits.  The value being inspected is =conn.daemonVersion=, which is defined in
the same =RemoteStore::Connection= struct.

#+begin_src c :results none :exports code
/**
 * Worker protocol version used for the connection.
 *
 * Despite its name, I think it is actually the maximum version both
 * sides support. (If the maximum doesn't exist, we would fail to
 * establish a connection and produce a value of this type.)
 */
WorkerProto::Version daemonVersion;
#+end_src

Near as I can tell, the entire version is just an integer.  It doesn't check for
major versions or use "good" version checking because the code before it will
throw errors if the major version is not aligned.  That still kind of implies a
major version increase (and thus a minor version reset) would break this logic.

Based on the masks, I think that there's just a 32bit integer being serialized
and sent over the wire, and then they are using bit masks to split them into two
numbers.

Another part of this too is the =nullopt= I think is treated differently than
not being trusted at all.  I don't recall where I spotted that but I will revise
if I see it again.  My next lead is the =TrustedFlag=.

